<?php
    $a = 3;
    $b = 4;
    $sum = $a + $b; // นำตัวแปรมาบวกกัน

    // ใส่ \ หน้าเครื่องหมาย $ เพื่อให้โปรแกรมพิมพ์คำว่า $a ออกมาเป็นข้อความ ไม่ใช่ดึงค่าตัวแปร
    echo "ค่าของ \$a คือ $a <br>";
    echo "ค่าของ \$b คือ $b <br>";
    echo "ผลรวมของ \$a และ \$b คือ $sum <br>";
?>

------------------------------------------------------------------------------

<?php
    $A = 'B';   // ตัวแปร $A มีค่าเท่ากับตัวอักษร 'B'
    $$A = 20.5; // $$A จะหมายถึงสร้างตัวแปรใหม่ชื่อ $B (ตามค่าของ $A) ให้มีค่า 20.5

    echo "\$A=$A <br>";
    echo "\$\$A=" . $$A . "<br>";
    echo "\$B=$B <br>"; // เมื่อพิมพ์ $B ออกมา ค่าจึงเท่ากับ 20.5 ด้วยนั่นเอง
?>
